Tekla Open API Reference for Tekla Structures 2025
PrinterItemEnumerator Class
 The PrinterItemEnumerator class allows to loop through the catalog printer items.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.PrinterItemEnumerator
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PrinterItemEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class PrinterItemEnumerator
	Implements IEnumerator
The PrinterItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a printer item instance of the current element.
Top
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
Examples
 The following example returns true if an item with the name PDFactoryA3 has been found:
using Tekla.Structures.Catalogs;
public class Example
{
       public bool Example1()
       {
           bool Result = false;
           CatalogHandler CatalogHandler = new CatalogHandler();
           if (CatalogHandler.GetConnectionStatus())
           {
               PrinterItemEnumerator PrinterItemEnumerator = CatalogHandler.GetPrinterItems();
               while (PrinterItemEnumerator.MoveNext())
               {
                   PrinterItem PrinterItem = PrinterItemEnumerator.Current as PrinterItem;
                   if (PrinterItem.Name == "PDFactoryA3")
                   {
                       Result = true;
                       break;
                   }
               }
           }
           return Result;
       }
}
See Also
Reference
Tekla.Structures.Catalogs Namespace